Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagsAttributes Constructor
 Creates a new mark tags attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkTagsAttributes()
Public Sub New
See Also
Reference
View.ViewMarkTagsAttributes Class
View.ViewMarkTagsAttributes Overload
Tekla.Structures.Drawing Namespace